taboadaa/ShuQi/nRF/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.5.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
	<vendor>AnalogDevices</vendor>
	<name>ADuCM302x_DFP</name>
	<description>Analog Devices ADuCM302x Device Support and Examples</description>
	<url>http://download.analog.com/tools/EZBoards/CM302x/Releases/</url>
	<supportContact>http://www.analog.com/en/support/technical-support.html</supportContact>
	<license>License/2016-10-07-CM302xKP Click Thru SLA.txt</license>

	<releases>
		<release version="1.0.5">
			Enables ECC during flash programming
		</release>
		<release version="1.0.4">
			Support release
		</release>
		<release version="1.0.3">
			Release supporting CrossCore Embedded Studio
		</release>
		<release version="1.0.2">
			Initial Release
		</release>
	</releases>

	<keywords>
		<!-- keywords for indexing -->
		<keyword>Analog Devices</keyword>
		<keyword>Device Support</keyword>
		<keyword>Device Family Package Analog Devices</keyword>
		<keyword>ADuCM302x</keyword>
		<keyword>ADuCM3027</keyword>
		<keyword>ADuCM3029</keyword>
	</keywords>
	<devices>
		<family Dfamily="ADuCM302x Series" Dvendor="Analog Devices:1">
			<description>
				The ADuCM302x is an ultra low-power integrated mixed-signal microcontroller system for processing, control and connectivity. The MCU system is based on an ARM Cortex(TM)-M3 processor, a collection of digital peripherals, embedded SRAM and flash memory, and an analog subsystem which provides clocking, reset and power management capability along with ADC.
			</description>

			<environment name="uv">
				<CMisc>--C99</CMisc>
				<AMisc>--cpreproc --cpreproc_opts=-U__STDC__,-D__ASSEMBLER__</AMisc>
			</environment>

			<environment name="cces">
				<properties>
					<property name="toolchain" value="arm.gcc.toolchain"/>
					<property name="gdb-qemu" value="false"/>
				</properties>

				<silicon-revisions command-line-default="1.0">
					<silicon revision="none"/>
					<silicon revision="1.0"/>
					<silicon revision="1.1"/>
					<silicon revision="1.2"/>
					<silicon revision="any"/>
				</silicon-revisions>
			</environment>

			<!-- ******************************  ADuCM3027  ****************************** -->
			<device Dname="ADuCM3027">
				<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="26000000"/>
				<debug      svd="SVD/ADuCM302x.svd"/>
				<algorithm  name="Flash/ADuCM302x.FLM"      start="0x00000000"  size="0x20000"  default="1"/>
				<memory     id="IROM1"                      start="0x00000000"  size="0x20000"  startup="1"   default="1"/>
				<memory     id="IRAM1"                      start="0x20000000"  size="0x04000"  init   ="1"   default="1"/>
				<memory     id="IRAM2"                      start="0x20040000"  size="0x04000"  init   ="1"   default="1"/>
				<compile header="Include/ADuCM3027.h"  define="__ADUCM3027__"/>
			</device>

			<!-- ******************************  ADuCM3029  ****************************** -->
			<device Dname="ADuCM3029">
				<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="26000000"/>
				<debug      svd="SVD/ADuCM302x.svd"/>
				<algorithm  name="Flash/ADuCM302x.FLM"      start="0x00000000"  size="0x40000"  default="1"/>
				<memory     id="IROM1"                      start="0x00000000"  size="0x40000"  startup="1"   default="1"/>
				<memory     id="IRAM1"                      start="0x20000000"  size="0x04000"  init   ="1"   default="1"/>
				<memory     id="IRAM2"                      start="0x20040000"  size="0x04000"  init   ="1"   default="1"/>
				<compile header="Include/ADuCM3029.h"  define="__ADUCM3029__"/>
			</device>
		</family>
	</devices>

	<conditions>
		<condition id="ARMCC">
			<require Tcompiler="ARMCC"/>
		</condition>
		<condition id="GCC">
			<require Tcompiler="GCC"/>
		</condition>

		<condition id="ADuCM302x">
			<description>ADuCM302x device</description>
			<require Dvendor="Analog Devices:1"/>
			<accept Dname="ADuCM3027"/>
			<accept Dname="ADuCM3029"/>
		</condition>
		<condition id="ADuCM3027">
			<description>ADuCM3027 device</description>
			<require Dvendor="Analog Devices:1"/>
			<accept Dname="ADuCM3027"/>
		</condition>
		<condition id="ADuCM3029">
			<description>ADuCM3029 device</description>
			<require Dvendor="Analog Devices:1"/>
			<accept Dname="ADuCM3029"/>
		</condition>
		<condition id="ADuCM302x Retarget">
			<description>ADuCM302x retargetting requirements</description>
			<require condition="ADuCM302x"/>
			<require condition="ARMCC"/>
			<require Cclass="Device" Cgroup="Drivers" Csub="UART"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
			<require Cclass="Device" Cgroup="Services" Csub="Power"/>
		</condition>
		<condition id="ADuCM302x Examples Support">
			<description>ADuCM302x Examples Support requirements</description>
			<require condition="ADuCM302x"/>
			<require Cclass="Device" Cgroup="Services" Csub="WDT"/>
		</condition>
		<condition id="ADuCM302x Driver">
			<description>Common ADuCM302x driver requirements</description>
			<require condition="ADuCM302x"/>
			<require Cclass="CMSIS" Cgroup="CORE"/>
			<require Cclass="Device" Cgroup="Global Configuration"/>
		</condition>
		<condition id="ADuCM302x ADC">
			<description>ADuCM302x ADC driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
		</condition>
		<condition id="ADuCM302x ADXL363">
			<description>ADuCM302x ADXL363 driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Drivers" Csub="SPI"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
			<require Cclass="Device" Cgroup="Services" Csub="GPIO"/>
			<require Cclass="Device" Cgroup="Services" Csub="Power"/>
		</condition>
