taboadaa/ShuQi/nRF/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.5.pdsc
		<condition id="ADuCM302x Crypto">
			<description>ADuCM302x Crypto driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
		</condition>
		<condition id="ADuCM302x Flash">
			<description>ADuCM302x Flash driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
		</condition>
		<condition id="ADuCM302x I2C">
			<description>ADuCM302x I2C driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
			<require Cclass="Device" Cgroup="Services" Csub="Power"/>
		</condition>
		<condition id="ADuCM302x SPI">
			<description>ADuCM302x SPI driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
			<require Cclass="Device" Cgroup="Services" Csub="Power"/>
		</condition>
		<condition id="ADuCM302x SPORT">
			<description>ADuCM302x SPORT driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
		</condition>
		<condition id="ADuCM302x UART">
			<description>ADuCM302x UART driver requirements</description>
			<require condition="ADuCM302x Driver"/>
			<require Cclass="Device" Cgroup="Services" Csub="DMA"/>
			<require Cclass="Device" Cgroup="Services" Csub="Power"/>
		</condition>
		<condition id="ADuCM302x_ARM">
			<description>ADuCM302x ARM (Keil) </description>
			<require condition="ADuCM302x"/>
			<require condition="ARMCC"/>
		</condition>
		<condition id="ADuCM3027_ARM">
			<description>ADuCM3027 ARM (Keil) </description>
			<require condition="ADuCM3027"/>
			<require condition="ARMCC"/>
		</condition>
		<condition id="ADuCM3029_ARM">
			<description>ADuCM3029 ARM (Keil) </description>
			<require condition="ADuCM3029"/>
			<require condition="ARMCC"/>
		</condition>
		<condition id="ADuCM302x_GCC">
			<description>ADuCM302x GCC</description>
			<require condition="ADuCM302x"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM3027_GCC">
			<description>ADuCM3027 GCC</description>
			<require condition="ADuCM3027"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM3029_GCC">
			<description>ADuCM3029 GCC</description>
			<require condition="ADuCM3029"/>
			<require condition="GCC"/>
		</condition>
	</conditions>

	<taxonomy>
		<description Cclass="Device" Cgroup="Services" doc="Docs/html/index.html">Analog Devices services component for ADuCM302x devices</description>
		<description Cclass="Device" Cgroup="Drivers" doc="Docs/html/index.html">Analog Devices driver components for ADuCM302x devices</description>
	</taxonomy>

	<components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>System Startup for ADuCM302x</description>
			<files>
				<!-- additional include path -->
				<file category="include" name="Include/"/>
				<!-- startup files -->
				<file category="source" name="Source/ARM/startup_ADuCM3027.s" version="1.0.0" attr="config" condition="ADuCM3027_ARM"/>
				<file category="source" name="Source/ARM/startup_ADuCM3029.s" version="1.0.0" attr="config" condition="ADuCM3029_ARM"/>
				<file category="source" name="Source/GCC/startup_ADuCM3027.c" version="1.0.0" attr="config" condition="ADuCM3027_GCC"/>
				<file category="source" name="Source/GCC/startup_ADuCM3029.c" version="1.0.0" attr="config" condition="ADuCM3029_GCC"/>
				<!-- system files -->
				<file category="source" name="Source/system_ADuCM3027.c" version="1.0.0" attr="config" condition="ADuCM3027"/>
				<file category="source" name="Source/system_ADuCM3029.c" version="1.0.0" attr="config" condition="ADuCM3029"/>
				<!-- linker scripts -->
				<file category="linkerScript" name="Source/GCC/ADuCM3027.ld" version="1.0.0" attr="config" condition="ADuCM3027_GCC"/>
				<file category="linkerScript" name="Source/GCC/ADuCM3029.ld" version="1.0.0" attr="config" condition="ADuCM3029_GCC"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Retarget" Cversion="1.0.0" condition="ADuCM302x Retarget">
			<description>Retargeting for ADuCM302x devices</description>
			<files>
				<file category="source" name="Source/Retarget.c"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Examples Support" Cversion="1.0.0" condition="ADuCM302x Examples Support">
			<description>Common utility functions for ADuCM302x examples</description>
			<files>
				<file category="source" name="Source/common.c"/>
				<file category="header" name="Include/common.h"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Global Configuration" Cversion="1.0.0" condition="ADuCM302x">
			<description>Global configuration file for ADuCM302x drivers and services</description>
			<files>
				<file category="header" name="Include/config/adi_global_config.h" version="1.0.0" attr="config"/>
			</files>
		</component>

		<!-- Services -->
		<component Cclass="Device" Cgroup="Services" Csub="DMA" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>DMA</description>
			<files>
				<file category="source" name="Source/services/dma/adi_dma.c"/>
				<file category="doc" name="Docs/html/group___d_m_a___service.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Services" Csub="GPIO" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>GPIO</description>
			<files>
				<file category="source" name="Source/services/gpio/adi_gpio.c"/>
				<file category="doc" name="Docs/html/group___g_p_i_o___service.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Services" Csub="Interrupt" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>Interrupt</description>
			<files>
				<file category="source" name="Source/services/int/adi_int.c"/>
				<file category="source" name="Source/services/int/adi_nvic.c"/>
				<file category="doc" name="Docs/html/group___r_t_o_s___i_n_t_e_r_r_u_p_t_s.html"/>
			</files>
		</component>

