taboadaa/ShuQi/nRF/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.5.pdsc
		<component Cclass="Device" Cgroup="Services" Csub="Power" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>Dynamic Power Management</description>
			<files>
				<file category="source" name="Source/services/pwr/adi_pwr.c"/>
				<file category="header" name="Include/config/adi_pwr_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___power___service.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Services" Csub="RTC" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>RTC</description>
			<files>
				<file category="source" name="Source/services/rtc/adi_rtc.c"/>
				<file category="header" name="Include/config/adi_rtc_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___r_t_c___service.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Services" Csub="TMR" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>GP Timer</description>
			<files>
				<file category="source" name="Source/services/tmr/adi_tmr.c"/>
				<file category="header" name="Include/config/adi_tmr_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___g_p___timer___service.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Services" Csub="WDT" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>WDT</description>
			<files>
				<file category="source" name="Source/services/wdt/adi_wdt.c"/>
				<file category="header" name="Include/config/adi_wdt_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___w_d_t___service.html"/>
			</files>
		</component>

		<!-- Drivers -->
		<component Cclass="Device" Cgroup="Drivers" Csub="ADXL363" Cversion="1.0.0" condition="ADuCM302x ADXL363">
			<description>ADXL363</description>
			<files>
				<file category="source" name="Source/drivers/accel/adxl363/adi_adxl363.c"/>
				<file category="header" name="Include/config/adi_adxl363_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group__adxl363___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="ADuCM302x ADC">
			<description>ADC</description>
			<files>
				<file category="source" name="Source/drivers/adc/adi_adc.c"/>
				<file category="header" name="Include/config/adi_adc_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___a_d_c___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="BEEP" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>BEEP</description>
			<files>
				<file category="source" name="Source/drivers/beep/adi_beep.c"/>
				<file category="header" name="Include/config/adi_beep_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___b_e_e_p___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>CRC</description>
			<files>
				<file category="source" name="Source/drivers/crc/adi_crc.c"/>
				<file category="header" name="Include/config/adi_crc_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___c_r_c___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="Crypto" Cversion="1.0.0" condition="ADuCM302x Crypto">
			<description>Crypto</description>
			<files>
				<file category="source" name="Source/drivers/crypto/adi_crypto.c"/>
				<file category="header" name="Include/config/adi_crypto_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___crypto___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="Flash" Cversion="1.0.0" condition="ADuCM302x Flash">
			<description>Flash Controller</description>
			<files>
				<file category="source" name="Source/drivers/flash/adi_flash.c"/>
				<file category="header" name="Include/config/adi_flash_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___flash___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="ADuCM302x I2C">
			<description>I2C</description>
			<files>
				<file category="source" name="Source/drivers/i2c/adi_i2c.c"/>
				<file category="header" name="Include/config/adi_i2c_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___i2_c___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="RNG" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>RNG</description>
			<files>
				<file category="source" name="Source/drivers/rng/adi_rng.c"/>
				<file category="header" name="Include/config/adi_rng_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___r_n_g___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="ADuCM302x SPI">
			<description>SPI</description>
			<files>
				<file category="source" name="Source/drivers/spi/adi_spi.c"/>
				<file category="header" name="Include/config/adi_spi_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___s_p_i___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="SPORT" Cversion="1.0.0" condition="ADuCM302x SPORT">
			<description>SPORT</description>
			<files>
				<file category="source" name="Source/drivers/sport/adi_sport.c"/>
				<file category="header" name="Include/config/adi_sport_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___s_p_o_r_t___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="ADuCM302x UART">
			<description>UART</description>
			<files>
				<file category="source" name="Source/drivers/uart/adi_uart.c"/>
				<file category="header" name="Include/config/adi_uart_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___u_a_r_t___driver.html"/>
			</files>
		</component>

	</components>

