taboadaa/ShuQi/nRF/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.5.pdsc
	<boards>
		<board vendor="AnalogDevices" name="ADuCM3029 EZ-BOARD" revision="Ver 1.0">
			<description>Analog Devices ADuCM3029 Evaluation Board</description>
			<mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM3029"/>
			<compatibleDevice deviceIndex="0" Dvendor="Analog Devices:1" Dfamily="ADuCM302x Series"/>
			<feature type="PWR"             n="5"              name="External 5.0VDC/3.6A power supply"/>
			<debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
		</board>
	</boards>

	<examples>
		<example name="HelloWorld" doc="Readme_HelloWorld.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/HelloWorld" version="1.0.0">
			<description>Hello World</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="HelloWorld.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
			</attributes>
		</example>

		<example name="HelloWorld" doc="Readme_HelloWorld.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/HelloWorld" version="1.0.0">
			<description>Hello World</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
			</attributes>
		</example>

		<example name="Beep" doc="Readme_beep_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/beep" version="1.0.0">
			<description>Audible Beep</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="beep_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="BEEP"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Beep" doc="Readme_beep_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/beep" version="1.0.0">
			<description>Audible Beep</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="BEEP"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="CRC" doc="Readme_crc_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/crc" version="1.0.0">
			<description>CRC driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="crc_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="CRC" doc="Readme_crc_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/crc" version="1.0.0">
			<description>CRC driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Crypto" doc="Readme_crypto_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/crypto" version="1.0.0">
			<description>Crypto driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="crypto_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="Crypto"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Crypto" doc="Readme_crypto_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/crypto" version="1.0.0">
			<description>Crypto driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="Crypto"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

