taboadaa/ShuQi/nRF/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.5.pdsc
		<example name="Watchdog" doc="Readme_watchdog_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/wdt" version="1.0.0">
			<description>Watchdog Timer</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Services" Csub="TMR"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Temperature_Sensor" doc="Readme_temperature_sensor.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/i2c/temperature_sensor" version="1.0.0">
			<description>I2C Temperature sensor example</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="I2C"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

	</examples>

</package>
